#include<stdio.h>

#include<stdlib.h>

int main(){

    int i,x=0;

    double a,b,c,d,e,f=0;
 //それぞれダイスの1,2,3,4,5,6に対応
    for(i=0;i<1000000;i++){
 //試行回数
        x=rand()%6+1; //自然数の乱数を発生させ、6で割った余りに1を足すことで1～6の乱数を生成

        if(x==1){

            a++;

        }

        else if(x==2){

            b++;

        }

        else if(x==3){

            c++;

        }

        else if(x==4){

            d++;

        }

        else if(x==5){

            e++;

        }

        else{

            f++;

        }

    }

    printf("%lf, %lf, %lf, %lf, %lf, %lf\n",a/1000000,b/1000000,c/1000000,d/1000000,e/1000000,f/1000000); //それぞれの目が出た回数/試行回数
    printf("%lf",(b+d+f)/1000000); //ダイスの目が2,4,6だった時の確率の和
}

//結果　0.166511, 0.166655, 0.167279, 0.166835, 0.166365, 0.166355   0.499845